### uriage 
1. csv 폴더 안에 있는 uriage.csv 로드 
2. 데이터프레임의 상단의 5개의 데이터를 추출 확인
3. 데이터프레임의 정보를 확인 
4. 데이터프레임에 결측치가 존재하는가?
5. 데이터의 문제가 얼마나 있는가?

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("../csv/uriage.csv")

In [3]:
df.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05     상 품 S         NaN           김우찬
2  2019-05-11 19:42     상 품 a         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품a         NaN           김강현

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   purchase_date  2999 non-null   object
 1   item_name      2999 non-null   object
 2   item_price     2612 non-null   float64
 3   customer_name  2999 non-null   object
dtypes: float64(1), object(3)
memory usage: 93.8+ KB

In [5]:
df.isna().sum()

purchase_date      0
item_name          0
item_price       387
customer_name      0
dtype: int64

In [6]:
df.describe()

        item_price
count  2612.000000
mean   1296.401225
std     717.955460
min     100.000000
25%     700.000000
50%    1300.000000
75%    1900.000000
max    2600.000000

### uriage 데이터에서 문제점 
1. item_name의 데이터가 대/소문자 문제
    - 모든 문자열을 대문자나 아니면 소문자로 통일
    - upper(), lower()
2. item_name의 데이터가 문자열 사이에 공백 존재 
    - 문자열 사이의 공백을 제거 
    - strip() : 문자열 시작과 끝에 있는 공백을 제거 
    - replace() : 특정 문자를 선택하여 다른 문자로 대체

In [7]:
df.loc[2, 'item_name'] = df.loc[2,'item_name'].upper()

In [8]:
df.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05     상 품 S         NaN           김우찬
2  2019-05-11 19:42     상 품 A         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품a         NaN           김강현

In [9]:
len(df)

2999

In [10]:
# case 1 ( for문을 이용하여 item_name의 데이터들을 모두 대문자로 변경 )
df2 = df.copy()
# for i in range(0, len(df2), 1):
for i in range(len(df2)):
    # print(i)
    df2.loc[i, 'item_name'] = df2.loc[i, 'item_name'].upper()
df2.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05     상 품 S         NaN           김우찬
2  2019-05-11 19:42     상 품 A         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품A         NaN           김강현

In [11]:
# case2 (map 함수를 이용하여 문자를 변경)
# Series.map(함수) --> 함수의 종류 (일반 def 함수, lambda함수)
def change(x):
    # print(type(x), x)
    return x.lower()
df2['item_name'].map(change)

0         상품a
1       상 품 s
2       상 품 a
3         상품z
4         상품a
        ...
2994      상품y
2995      상품m
2996      상품q
2997      상품h
2998      상품d
Name: item_name, Length: 2999, dtype: object

In [12]:
df2['item_name'].map(
    lambda x : x.lower()
)

0         상품a
1       상 품 s
2       상 품 a
3         상품z
4         상품a
        ...
2994      상품y
2995      상품m
2996      상품q
2997      상품h
2998      상품d
Name: item_name, Length: 2999, dtype: object

In [13]:
# case3 (while 문)
# 초기 값을 지정
i = 0
# while 조건식 (해당 조건식이 거짓이 될때까지 반복 실행)
while i < len(df2):
    # 반복 실행 할 코드 
    df2.loc[i, 'item_name'] = df2.loc[i, 'item_name'].lower()
    # i의 값을 1씩 증가
    i += 1
df2.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품a       100.0           김가온
1  2019-07-13 13:05     상 품 s         NaN           김우찬
2  2019-05-11 19:42     상 품 a         NaN           김유찬
3  2019-02-12 23:40       상품z      2600.0           김재현
4   2019-04-22 3:09       상품a         NaN           김강현

In [14]:
# case4 ( Series에서 문자열 함수를 사용 )
df['item_name'].str.upper()

0         상품A
1       상 품 S
2       상 품 A
3         상품Z
4         상품A
        ...
2994      상품Y
2995      상품M
2996      상품Q
2997      상품H
2998      상품D
Name: item_name, Length: 2999, dtype: object

In [40]:
## item_name에 있는 문자열 사이의 공백을 제거 
df['item_name'].str.replace(" ", "")

0       상품A
1       상품S
2       상품A
3       상품Z
4       상품A
       ...
2994    상품Y
2995    상품M
2996    상품Q
2997    상품H
2998    상품D
Name: item_name, Length: 2999, dtype: object

In [16]:
df['item_name'].str.upper().str.replace(" ", "")

0       상품A
1       상품S
2       상품A
3       상품Z
4       상품A
       ...
2994    상품Y
2995    상품M
2996    상품Q
2997    상품H
2998    상품D
Name: item_name, Length: 2999, dtype: object

In [17]:
a = df['item_name'].str.upper()
df['item_name'] = a.str.replace(" ", "")

In [18]:
df.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05       상품S         NaN           김우찬
2  2019-05-11 19:42       상품A         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품A         NaN           김강현

### 결측치를 특정 데이터로 대체
1. item_name이 상품A인 데이터만 추출 
2. 상품A이고 item_price가 결측치인 데이터만 추출 
3. 상품A이고 item_price가 결측치가 아닌 데이터만 추출

In [19]:
# 인덱스의 조건식을 생성 
flag = df['item_name'] == '상품A'
flag_null = df['item_price'].isna()

In [20]:
flag_null

0       False
1        True
2        True
3       False
4        True
        ...
2994    False
2995    False
2996     True
2997     True
2998    False
Name: item_price, Length: 2999, dtype: bool

In [21]:
# item_name이 상품A이고 item_price가 결측치인 데이터를 출력
df.loc[flag & flag_null]

         purchase_date item_name  item_price customer_name
2     2019-05-11 19:42       상품A         NaN           김유찬
4      2019-04-22 3:09       상품A         NaN           김강현
6     2019-05-18 19:16       상품A         NaN           김재준
14    2019-06-11 12:57       상품A         NaN           김재호
300   2019-04-06 11:06       상품A         NaN           김태인
361    2019-01-21 3:33       상품A         NaN           김진우
667   2019-03-16 17:23       상품A         NaN           김주원
838    2019-06-24 5:06       상품A         NaN           김시호
844    2019-03-15 9:14       상품A         NaN           김강현
957   2019-07-19 14:12       상품A         NaN           김서윤
1260  2019-01-15 22:59       상품A         NaN           김하진
1394  2019-07-07 21:49       상품A         NaN           김은우
1474   2019-04-11 2:22       상품A         NaN           김선우
1892   2019-07-31 1:32       상품A         NaN           김윤찬
1937   2019-02-13 7:28       상품A         NaN           김시환
1977   2019-02-28 4:11       상품A         NaN           김서준
2063  2019-05-25 12:51       상품A         NaN           김재민
2278   2019-07-14 3:39       상품A         NaN           김시우
2636  2019-03-09 14:20       상품A         NaN           김우찬
2669  2019-03-05 20:21       상품A         NaN           김주혁
2732  2019-01-28 22:13       상품A         NaN           김윤호
2821  2019-06-21 11:09       상품A         NaN           김승훈

In [22]:
# item_name이 상품A이고 item_price가 결측치가 아닌(flag_null의 부정) 데이터를 출력 
df.loc[flag & ~flag_null, 'item_price'].value_counts()

item_price
100.0    117
Name: count, dtype: int64

In [23]:
mean_data = df.loc[flag & ~flag_null, 'item_price'].mean()
mean_data

100.0

In [24]:
# item_name이 상품A이고 item_price가 결측치인 데이터에서 item_price 컬럼의 데이터만 출력
# Series 데이터에 단일 데이터를 대입한다면 Series의 모든 value는 대입하는 단일 데이터로 변경
df.loc[flag & flag_null, 'item_price'] = mean_data

In [25]:
df.loc[flag & flag_null]

         purchase_date item_name  item_price customer_name
2     2019-05-11 19:42       상품A       100.0           김유찬
4      2019-04-22 3:09       상품A       100.0           김강현
6     2019-05-18 19:16       상품A       100.0           김재준
14    2019-06-11 12:57       상품A       100.0           김재호
300   2019-04-06 11:06       상품A       100.0           김태인
361    2019-01-21 3:33       상품A       100.0           김진우
667   2019-03-16 17:23       상품A       100.0           김주원
838    2019-06-24 5:06       상품A       100.0           김시호
844    2019-03-15 9:14       상품A       100.0           김강현
957   2019-07-19 14:12       상품A       100.0           김서윤
1260  2019-01-15 22:59       상품A       100.0           김하진
1394  2019-07-07 21:49       상품A       100.0           김은우
1474   2019-04-11 2:22       상품A       100.0           김선우
1892   2019-07-31 1:32       상품A       100.0           김윤찬
1937   2019-02-13 7:28       상품A       100.0           김시환
1977   2019-02-28 4:11       상품A       100.0           김서준
2063  2019-05-25 12:51       상품A       100.0           김재민
2278   2019-07-14 3:39       상품A       100.0           김시우
2636  2019-03-09 14:20       상품A       100.0           김우찬
2669  2019-03-05 20:21       상품A       100.0           김주혁
2732  2019-01-28 22:13       상품A       100.0           김윤호
2821  2019-06-21 11:09       상품A       100.0           김승훈

In [26]:
## item_name에 데이터들에서 중복 데이터를 모두 제거하고 리스트형태로 데이터를 생성
df['item_name']

# 데이터가 추가될 공간을 생성 (빈 리스트 생성)
item_list = []
item_list2 = []
item_list3 = []
for i in range(len(df)):
    data = df.loc[i, 'item_name']
    # item_list에 data가 존재하는가?
    # 존재하지 않는다면 item_list에 data를 추가 
    # 존재한다면 아무 행동도 하지 않는다. 
    # in 연산자 : 포함 여부 
    # case1
    if data not in item_list:
        item_list.append(data)
    # case2
    # list의 내장함수를 이용
    # count() 이용하면 0과 같은 경우 : 데이터가 존재 하지 않는다. 
    # index() 이용하면 에러가 발생하는 경우 : 데이터가 존재 하지 않는다
    if item_list2.count(data) == 0:
        item_list2.append(data)
    
    # 시도한다. 
    try:
        item_list3.index(data)
    except:
        # try의 코드가 에러가 발생한다면
        item_list3.append(data)
print(item_list)
print(item_list2)
print(item_list3)

['상품A', '상품S', '상품Z', '상품V', '상품O', '상품U', '상품L', '상품C', '상품I', '상품R', '상품X', '상품G', '상품P', '상품Q', '상품Y', '상품N', '상품W', '상품E', '상품K', '상품B', '상품F', '상품D', '상품M', '상품H', '상품T', '상품J']
['상품A', '상품S', '상품Z', '상품V', '상품O', '상품U', '상품L', '상품C', '상품I', '상품R', '상품X', '상품G', '상품P', '상품Q', '상품Y', '상품N', '상품W', '상품E', '상품K', '상품B', '상품F', '상품D', '상품M', '상품H', '상품T', '상품J']
['상품A', '상품S', '상품Z', '상품V', '상품O', '상품U', '상품L', '상품C', '상품I', '상품R', '상품X', '상품G', '상품P', '상품Q', '상품Y', '상품N', '상품W', '상품E', '상품K', '상품B', '상품F', '상품D', '상품M', '상품H', '상품T', '상품J']

In [27]:
# 집합(set) 데이터로 변환 : 중복데이터가 제거 
for i in set(df['item_name']):
    print(i)

상품G
상품Z
상품Y
상품X
상품F
상품S
상품V
상품A
상품P
상품R
상품M
상품T
상품Q
상품C
상품W
상품J
상품N
상품I
상품O
상품U
상품B
상품L
상품D
상품H
상품K
상품E

In [28]:
# Series에서 중복 데이터를 제거하는 함수
item_list4 = list(df['item_name'].unique())

In [29]:
item_list4.sort()
item_list4

['상품A',
 '상품B',
 '상품C',
 '상품D',
 '상품E',
 '상품F',
 '상품G',
 '상품H',
 '상품I',
 '상품J',
 '상품K',
 '상품L',
 '상품M',
 '상품N',
 '상품O',
 '상품P',
 '상품Q',
 '상품R',
 '상품S',
 '상품T',
 '상품U',
 '상품V',
 '상품W',
 '상품X',
 '상품Y',
 '상품Z']

In [30]:
for item in item_list:
    # print(item)
    # 인덱스의 조건식을 생성 
    flag = df['item_name'] == item
    # item_price가 결측치인 조건식
    flag_null = df['item_price'].isna()

    # flag와 flag_null의 부정의 조건식이 모두 만족하는 item_price의 평균 데이터를 생성
    mean_data = df.loc[flag & ~flag_null, 'item_price'].mean()
    # flag와 flag_null 조건식을 모두 만족하는 item_price에 mean_data 대입 
    df.loc[flag & flag_null, 'item_price'] = mean_data

In [31]:
df.isna().sum()

purchase_date    0
item_name        0
item_price       0
customer_name    0
dtype: int64

In [32]:
# 그룹화 -> groupby({그룹화를 할 컬럼의 이름})
df.groupby('item_name')['item_price'].mean()

item_name
상품A     100.0
상품B     200.0
상품C     300.0
상품D     400.0
상품E     500.0
상품F     600.0
상품G     700.0
상품H     800.0
상품I     900.0
상품J    1000.0
상품K    1100.0
상품L    1200.0
상품M    1300.0
상품N    1400.0
상품O    1500.0
상품P    1600.0
상품Q    1700.0
상품R    1800.0
상품S    1900.0
상품T    2000.0
상품U    2100.0
상품V    2200.0
상품W    2300.0
상품X    2400.0
상품Y    2500.0
상품Z    2600.0
Name: item_price, dtype: float64

In [33]:
df[ ['item_name', 'item_price'] ].groupby('item_name').mean()

           item_price
item_name
상품A             100.0
상품B             200.0
상품C             300.0
상품D             400.0
상품E             500.0
상품F             600.0
상품G             700.0
상품H             800.0
상품I             900.0
상품J            1000.0
상품K            1100.0
상품L            1200.0
상품M            1300.0
상품N            1400.0
상품O            1500.0
상품P            1600.0
상품Q            1700.0
상품R            1800.0
상품S            1900.0
상품T            2000.0
상품U            2100.0
상품V            2200.0
상품W            2300.0
상품X            2400.0
상품Y            2500.0
상품Z            2600.0

In [34]:
# pivot_table() 
# pandas 안에 내장된 함수 -> 라이브러리 안에 존재하는 함수 
    # 라이브러리 안에 함수 : 인자 값에 데이터를 입력
# DataFrame 안에 내장된 함수 -> DataFrame Class 안에 존재하는 함수
    # Class(변수 + 함수) 안에 존재하는 함수 : 인자 값에 데이터를 입력하지 않는다. 

# 라이브러리 안에 존재하는 pivot_table
pd.pivot_table(
    df, 
    index = 'item_name', 
    values = 'item_price', 
    aggfunc= 'mean'
)

           item_price
item_name
상품A             100.0
상품B             200.0
상품C             300.0
상품D             400.0
상품E             500.0
상품F             600.0
상품G             700.0
상품H             800.0
상품I             900.0
상품J            1000.0
상품K            1100.0
상품L            1200.0
상품M            1300.0
상품N            1400.0
상품O            1500.0
상품P            1600.0
상품Q            1700.0
상품R            1800.0
상품S            1900.0
상품T            2000.0
상품U            2100.0
상품V            2200.0
상품W            2300.0
상품X            2400.0
상품Y            2500.0
상품Z            2600.0

In [35]:
df.pivot_table(
    index = 'item_name', 
    values = 'item_price', 
    aggfunc = 'mean'
)

           item_price
item_name
상품A             100.0
상품B             200.0
상품C             300.0
상품D             400.0
상품E             500.0
상품F             600.0
상품G             700.0
상품H             800.0
상품I             900.0
상품J            1000.0
상품K            1100.0
상품L            1200.0
상품M            1300.0
상품N            1400.0
상품O            1500.0
상품P            1600.0
상품Q            1700.0
상품R            1800.0
상품S            1900.0
상품T            2000.0
상품U            2100.0
상품V            2200.0
상품W            2300.0
상품X            2400.0
상품Y            2500.0
상품Z            2600.0